arduino/Arduino/hardware/msp430/cores/msp430/twi.c
/*
  ************************************************************************
  *	twi.c
  *
  *	Arduino core files for MSP430
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *
  ***********************************************************************
  Derived from:
  twi.c - TWI/I2C library for Wiring & Arduino
  Copyright (c) 2006 Nicholas Zambetti.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include <math.h>
#include <stdlib.h>
#include "Energia.h" // for digitalWrite
 
#ifndef cbi
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
#endif

#ifndef sbi
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#endif

#include "wiring_private.h"
#include "pins_energia.h"
#include "twi.h"
#include "usci_isr_handler.h"

static volatile uint8_t twi_state;
static volatile uint8_t twi_sendStop;           // should the transaction end with a stop
static volatile uint8_t twi_inRepStart;         // in the middle of a repeated start

static void (*twi_onSlaveTransmit)(void);
static void (*twi_onSlaveReceive)(uint8_t*, int);

static uint8_t twi_masterBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_masterBufferIndex;
static uint8_t twi_masterBufferLength;

static uint8_t twi_txBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_txBufferIndex;
static volatile uint8_t twi_txBufferLength;
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) \
 || defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B0__)
static uint8_t twi_rxBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_rxBufferIndex;
#endif

static volatile uint8_t twi_error;

#ifdef __MSP430_HAS_USI__
static uint8_t twi_slarw;
static uint8_t twi_my_addr;

#endif

#if defined(__MSP430_HAS_USCI__) \
 || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__) \
 || defined(__MSP430_HAS_EUSCI_B0__)
#ifndef USE_USCI_B1
#define UCBxCTLW0     UCB0CTLW0
#define UCBxCTLW1     UCB0CTLW1
#define UCBxCTL0      UCB0CTL0
#define UCBxCTL1      UCB0CTL1
#define UCBxCTL0      UCB0CTL0
#define UCBxBRW       UCB0BRW
#define UCBxBR0       UCB0BR0
#define UCBxBR1       UCB0BR1
#define UCBxMCTL      UCB0MCTL
#define UCBxMCTLW     UCB0MCTLW
#define UCBxSTAT      UCB0STAT
#define UCBxRXBUF     UCB0RXBUF
#define UCBxTXBUF     UCB0TXBUF
#define UCBxABCTL     UCB0ABCTL
#define UCBxIRCTL     UCB0IRCTL
#define UCBxIRTCTL    UCB0IRTCTL
#define UCBxIRRCTL    UCB0IRRCTL
#define UCBxICTL      UCB0ICTL
#define UCBxI2COA     UCB0I2COA
#define UCBxI2COA0    UCB0I2COA0
#define UCBxI2CSA     UCB0I2CSA
#define UCBxIE        UCB0IE
#define UCBxIFG       UCB0IFG
#define UCBxI2CIE     UCB0I2CIE
#define UCxIE         UC0IE
#define UCxIFG        UC0IFG
#define UCBxRXIE      UCB0RXIE
#define UCBxTXIE      UCB0TXIE
#define UCBxRXIFG     UCB0RXIFG
#define UCBxTXIFG     UCB0TXIFG
#define UCBxIV        UCB0IV
#else
#define UCBxCTLW0     UCB1CTLW0
#define UCBxCTLW1     UCB1CTLW1
#define UCBxCTL0      UCB1CTL0
#define UCBxCTL1      UCB1CTL1
#define UCBxCTL0      UCB1CTL0
#define UCBxBRW       UCB1BRW
#define UCBxBR0       UCB1BR0
#define UCBxBR1       UCB1BR1
#define UCBxMCTL      UCB1MCTL
#define UCBxMCTLW     UCB1MCTLW
#define UCBxSTAT      UCB1STAT
#define UCBxRXBUF     UCB1RXBUF
#define UCBxTXBUF     UCB1TXBUF
#define UCBxABCTL     UCB1ABCTL
#define UCBxIRCTL     UCB1IRCTL
#define UCBxIRTCTL    UCB1IRTCTL
#define UCBxIRRCTL    UCB1IRRCTL
#define UCBxICTL      UCB1ICTL
#define UCBxI2COA     UCB1I2COA
#define UCBxI2COA0    UCB1I2COA0
#define UCBxI2CSA     UCB1I2CSA
#define UCBxIE        UCB1IE
#define UCBxIFG       UCB1IFG
#define UCBxI2CIE     UCB1I2CIE
#define UCxIE         UC1IE
#define UCxIFG        UC1IFG
#define UCBxRXIE      UCB1RXIE
#define UCBxTXIE      UCB1TXIE
#define UCBxRXIFG     UCB1RXIFG
#define UCBxTXIFG     UCB1TXIFG
#define UCBxIV        UCB1IV
#endif
#endif

#ifdef __MSP430_HAS_USCI__
#endif

#ifdef __MSP430_HAS_EUSCI_B0__
#endif

/*
 * Function twi_init
 * Desc     readys twi pins and sets twi bitrate
 * Input    none
 * Output   none
 */
void twi_init(void)
{
	// initialize state
	twi_state = TWI_IDLE;
	twi_sendStop = true;		// default value
	twi_inRepStart = false;

#ifdef __MSP430_HAS_USI__

	/* 100 KHz for all */
#if (F_CPU >= 16000000L) || (F_CPU >= 12000000L)
	USICKCTL = USIDIV_7;
#elif defined(CALBC1_8MHZ_) && (F_CPU >= 8000000L)
	USICKCTL = USIDIV_6;
#elif defined(CALBC1_1MHZ_) && (F_CPU >= 1000000L)
	USICKCTL = USIDIV_3;
#endif
	/* Enable USI I2C mode. */
	USICTL1 = USII2C;
	/* SDA/SCL port enable and hold in reset */
	USICTL0 = (USIPE6 | USIPE7 | USISWRST);
	/* SMCLK and SCL inactive state is high */
	USICKCTL |= (USISSEL_2 | USICKPL);
	/* Disable automatic clear control */
	USICNT |= USIIFGCC;
	/* Enable USI */
	USICTL0 &= ~USISWRST;
	/* Counter interrupt enable */
	USICTL1 |= USIIE;
#endif

#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    /* Calling this dummy function prevents the linker
     * from stripping the USCI interupt vectors.*/ 
    usci_isr_install();

    /* Set pins to I2C mode */
    pinMode_int(TWISDA, TWISDA_SET_MODE);
    pinMode_int(TWISCL, TWISCL_SET_MODE);

    //Disable the USCI module and clears the other bits of control register
    UCBxCTL1 = UCSWRST;

     /*
     * Configure as I2C Slave.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode
     * UCCLK = SMCLK
     */
    UCBxCTL0 = UCMODE_3 | UCSYNC;
    /*
     * Compute the clock divider that achieves less than or
     * equal to 100kHz.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    UCBxBR0 = (unsigned char)((F_CPU / TWI_FREQ) & 0xFF);
    UCBxBR1 = (unsigned char)((F_CPU / TWI_FREQ) >> 8);

