arduino/Arduino/hardware/msp430/cores/msp430/twi.c
    UCBxCTL1 &= ~(UCSWRST);

#if defined(__MSP430_HAS_USCI__)
    /* Set I2C state change interrupt mask */
    UCBxI2CIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE);
    /* Enable state change and TX/RX interrupts */
    UCxIE |= UCBxRXIE | UCBxTXIE;
#else
    /* Set I2C state change interrupt mask and TX/RX interrupts */
    UCBxIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE|UCRXIE|UCTXIE);
#endif

#endif
#ifdef __MSP430_HAS_EUSCI_B0__

    pinMode_int(TWISDA, TWISDA_SET_MODE);
    pinMode_int(TWISCL, TWISCL_SET_MODE);

    //Disable the USCI module and clears the other bits of control register
    UCBxCTLW0 = UCSWRST;

    //Configure Automatic STOP condition generation
    UCBxCTLW1 &= ~UCASTP_3;

    /*
     * Configure as I2C master mode.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode (read/write 1 for eUSCI_B)
     * UCCLK = SMCLK
     */
    UCBxCTLW0 = UCMODE_3 | UCSSEL__SMCLK | UCSYNC | UCSWRST;

    /*
     * Compute the clock divider that achieves the fastest speed less than or
     * equal to the desired speed.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    UCBxBRW = (unsigned short)(F_CPU / 400000);
    UCBxCTLW0 &= ~(UCSWRST);
    UCBxIE |= (UCRXIE0|UCTXIE0|UCSTTIE|UCSTPIE); // Enable I2C interrupts
#endif
}

/*
 * Function twi_setAddress
 * Desc     sets slave address and enables interrupt
 * Input    none
 * Output   none
 */
void twi_setAddress(uint8_t address)
{
#ifdef __MSP430_HAS_USI__
	twi_my_addr = address << 1;
#endif
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
	/* UCGCEN = respond to general Call */
	UCBxI2COA = (address | UCGCEN);
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
	/* UCGCEN = respond to general Call */
	UCBxI2COA0 = (address | UCOAEN | UCGCEN);
#endif
}

/*
 * Function twi_readFrom
 * Desc     attempts to become twi bus master and read a
 *          series of bytes from a device on the bus
 * Input    address: 7bit i2c device address
 *          data: pointer to byte array
 *          length: number of bytes to read into array
 * Output   number of bytes read
 */
uint8_t twi_readFrom(uint8_t address, uint8_t* data, uint8_t length, uint8_t sendStop)
{
	uint8_t i;

#ifdef __MSP430_HAS_USI__
	/* Disable START condition interrupt */
	USICTL1 &= ~USISTTIE;
	/* I2C master mode */
	USICTL0 |= USIMST;
#endif
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    UCBxCTL1 = UCSWRST;                      // Enable SW reset
    UCBxCTL1 |= (UCSSEL_2);                  // I2C Master, synchronous mode
    UCBxCTL0 |= (UCMST | UCMODE_3 | UCSYNC); // I2C Master, synchronous mode
    UCBxCTL1 &= ~(UCTR);                     // Configure in receive mode
    UCBxI2CSA = address;                     // Set Slave Address
    UCBxCTL1 &= ~UCSWRST;                    // Clear SW reset, resume operation
#ifdef __MSP430_HAS_USCI__
    UCBxI2CIE |= (UCALIE|UCNACKIE|UCSTPIE);  // Enable I2C interrupts
    UCxIE |= (UCBxRXIE | UCBxTXIE);          // Enable I2C interrupts
#else
    UCBxIE |= (UCALIE|UCNACKIE|UCSTPIE|UCRXIE|UCTXIE);  // Enable I2C interrupts
#endif
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
    UCBxCTLW0 |= UCSWRST;                     // Enable SW reset
    UCBxCTLW0 |= (UCMST);                     // I2C Master, synchronous mode
    UCBxCTLW0 &= ~(UCTR);                     // Configure in receive mode
    UCBxI2CSA = address;                      // Set Slave Address
    UCBxCTLW0 &= ~UCSWRST;                    // Clear SW reset, resume operation
    UCBxIE |= (UCRXIE0|UCALIE|UCNACKIE|UCSTTIE|UCSTPIE); // Enable I2C interrupts
#endif
	// ensure data will fit into buffer
	if(TWI_BUFFER_LENGTH < length){
		return 0;
	}

	// initialize buffer iteration vars
	twi_masterBufferIndex = 0;
	twi_masterBufferLength = length-1;  // This is not intuitive, read on...
	// On receive, the previously configured ACK/NACK setting is transmitted in
	// response to the received byte before the interrupt is signalled.
	// Therefor we must actually set NACK when the _next_ to last byte is
	// received, causing that NACK to be sent in response to receiving the last
	// expected byte of data.

#ifdef __MSP430_HAS_USI__
	/* build sla+w, slave device address + w bit */
	twi_slarw = 1;
	twi_slarw |= address << 1;

	// send start condition
	twi_state = TWI_SND_START;
	// this will trigger an interrupt kicking off the state machine in the isr
	USICTL1 |= USIIFG;
#endif
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    twi_state =  TWI_MRX;                     // Master receive mode
    UCBxCTL1 |= UCTXSTT;                      // I2C start condition

    if(length == 1) {                         // When only receiving 1 byte..
        while(UCBxCTL1 & UCTXSTT);            // Wait for start bit to be sent
        UCBxCTL1 |= UCTXSTP;                  // Send I2C stop condition after recv
    }
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
    twi_state =  TWI_MRX;                     // Master receive mode
    while (UCBxCTLW0 & UCTXSTP);              // Ensure stop condition got sent
    UCBxCTLW0 |= UCTXSTT;                     // I2C start condition
#endif

	/* Wait in low power mode for read operation to complete */
	while(twi_state != TWI_IDLE){
		__bis_SR_register(LPM0_bits);
	}

	if (twi_masterBufferIndex < length)
		length = twi_masterBufferIndex;

	for(i = 0; i < length; ++i){
		data[i] = twi_masterBuffer[i];
	}

#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
	/* Ensure stop condition got sent before we exit. */
	while (UCBxCTL1 & UCTXSTP);
#endif
#if defined(__MSP430_HAS_EUSCI_B0__)
	/* Ensure stop condition got sent before we exit. */
	while (UCBxCTLW0 & UCTXSTP);
#endif
	return length;
}

/*
 * Function twi_writeTo
 * Desc     attempts to become twi bus master and write a
 *          series of bytes to a device on the bus
 * Input    address: 7bit i2c device address
 *          data: pointer to byte array
 *          length: number of bytes in array
 *          wait: boolean indicating to wait for write or not
 * Output   0 .. success
 *          1 .. length to long for buffer
 *          2 .. address send, NACK received
 *          3 .. data send, NACK received
 *          4 .. other twi error (lost bus arbitration, bus error, ..)
 */
uint8_t twi_writeTo(uint8_t address, uint8_t* data, uint8_t length, uint8_t wait, uint8_t sendStop)
{
	uint8_t i;
	twi_error = TWI_ERRROR_NO_ERROR;
	twi_sendStop = sendStop;

#ifdef __MSP430_HAS_USI__
	/* Disable START condition interrupt */
	USICTL1 &= ~USISTTIE;
	/* I2C master mode */
	USICTL0 |= USIMST;
#endif
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    UCBxCTL1 = UCSWRST;                      // Enable SW reset
    UCBxCTL1 |= UCSSEL_2;                    // SMCLK
    UCBxCTL0 |= (UCMST | UCMODE_3 | UCSYNC); // I2C Master, synchronous mode
    UCBxCTL1 |= UCTR;                        // Configure in transmit mode
    UCBxI2CSA = address;                     // Set Slave Address
    UCBxCTL1 &= ~UCSWRST;                    // Clear SW reset, resume operation
#ifdef __MSP430_HAS_USCI__
    UCBxI2CIE |= (UCALIE|UCNACKIE|UCSTPIE);  // Enable I2C interrupts
    UCxIE |= UCBxTXIE;                     // Enable I2C interrupts
#else
    UCBxIE |= (UCALIE|UCNACKIE|UCSTPIE|UCTXIE);  // Enable I2C interrupts
#endif
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
    UCBxCTLW0 |= UCSWRST;                     // Enable SW reset
    UCBxCTLW0 |= (UCMST | UCTR);              //  I2C Master, transmit mode
    UCBxI2CSA = address;                      // Set Slave Address
    UCBxCTLW0 &= ~UCSWRST;                    // Clear SW reset, resume operation
    UCBxIE |= (UCRXIE|UCTXIE0|UCALIE|UCNACKIE|UCSTPIE |UCBCNTIE); // Enable I2C interrupts
#endif
	if(length == 0) {
		return 0;
	}

	/* Ensure data will fit into buffer */
	if(length > TWI_BUFFER_LENGTH){
		return TWI_ERROR_BUF_TO_LONG;
	}


	/* initialize buffer iteration vars */
	twi_masterBufferIndex = 0;
	twi_masterBufferLength = length;

